
# СРЕДНЯЯ ЗАРПЛАТА ПРОГРАММИСТОВ
# В программе создали 6 переменных для хранения зарплат разработчиков разного уровня на разных языках.
# Используя Python-выражения, посчитайте среднюю зарплату всех программистов,
# а затем выведите полученное значение с помощью функции print().

js_junior = 50000
js_middle = 80000
js_senior = 130000
python_junior = 60000
python_middle = 85000
python_senior = 120000

# Напишите ваш код тут.
devs_selery_avg = (js_junior + js_middle + js_senior + python_senior + python_middle + python_junior) / 6
print(devs_selery_avg)