import sys
word = sys.argv[1]

# Напишите ваш код тут
print(len(word))